export default {
  translation: {
    en: "ภาษาอังกฤษ",
    th: "ไทย",
    my: "พม่า",
    header: {
      guest_user: "ลงทะเบียน / เข้าสู่ระบบ",
      share: "แบ่งปัน",
      contact_us: "ติดต่อเรา",
      messages: "ข้อความ",
      settings: "การตั้งค่า",
    },
    footer: {
      deposit: "ฝากเงิน",
      withdraw: "ถอนเงิน",
      history: "ประวัติ",
    },
    profile: {
      balance: "ยอดคงเหลือ",
      transactions: "ธุรกรรม",
      bonuses: "โบนัสและรางวัล",
      game_history: "ประวัติเกม",
      log_out: "ออกจากระบบ",
    },
    share: {
      title: "แบ่งปันและรับรางวัล",
      card_title: "แบ่งปันลิงค์แนะนำของคุณ",
      card_sub_title: "เชิญเพื่อนและรับ 10% ของการฝากเงินของพวกเขา",
      referal_status: "สถานะการแนะนำ",
      total_referals: "ทั้งหมดที่แนะนำ",
      active_users: "ผู้ใช้งานที่ใช้งานอยู่",
      total_earnings: "รายได้ทั้งหมด",
    },
    contact_us: {
      title: "ติดต่อเรา",
      sub_title:
        "ทีมสนับสนุนของเราพร้อมให้บริการตลอด 24 ชั่วโมง เลือกวิธีการติดต่อที่คุณต้องการด้านล่าง",
      email_support: "การสนับสนุนทางอีเมล",
      phone_support: "การสนับสนุนทางโทรศัพท์",
      live_chat: "แชทสด",
      office_hours: "เวลาทำการ",
      office_hours_value:
        "ทีมสนับสนุนลูกค้าของเราพร้อมให้บริการตลอด 24 ชั่วโมงทุกวัน",
    },
    settings: {
      title: "การตั้งค่า",
      dark_mode: "โหมดกลางคืน",
      notifications: "การแจ้งเตือน",
      sound_effects: "เสียงเอฟเฟกต์",
      language: "ภาษา",
    },
    responses: {
      "Login Successfully": "เข้าสู่ระบบสำเร็จแล้ว 🎉",
      "Wrong Password.": "กรุณากรอกรหัสผ่านที่ถูกต้อง!",
    },
  },
};
